Revit 2027 API
DirectShape.IsValidShape Method
Overload List
Name | Description
IsValidShape(ExternallyTaggedGeometryObject) |  Validates shape to be stored in a DirectShape.
IsValidShape(IList<GeometryObject>) |  Validates shape to be stored in a DirectShape. Supercedes and extends IsValidGeometry().
IsValidShape(IList<GeometryObject>, DirectShapeTargetViewType) |  Validates view-specific shape to be stored in a DirectShape. Expects a non-default view type.
Top
See Also
Reference
DirectShape Class
Autodesk.Revit.DB Namespace